Revit 2027 API
ScheduleDefinition.GetFieldCount Method
 Gets the number of fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetFieldCount()
Public Function GetFieldCount As Integer
public:
int GetFieldCount()
member GetFieldCount : unit -> int
Return Value
Int32
 The number of fields.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace